[{"url": "http://www.alealimay.com/blog/2014/10/13/fools-gold-day-off", "_id": {"$oid": "559be2b565f2886d5687b9a5"}, "extracted_text": "IA\nSo my good friend ATrak invited me to his annual Fools Gold Day Off Fest... and of course I couldn't miss out.  It turned out to be a reunion of great creatives such as Vic Mensa, Travis Scott, Danny Brown, Big Sean, Chuck English, Uzi, Mike Carson, Jerry Lorenzo and so many others.  Here's a small recap, enjoy!\n"},
{"url": "http://www.alealimay.com/blog/2014/10/20/558hqbx8345s0ew970ztm6y45xvpqf", "_id": {"$oid": "559be2b665f2886d5687b9a8"}, "extracted_text": "IA\nPatrick Mohr recently released his latest shoe with partner K1X. I held a brief interview with Patrick to get what inspired him growing up and the design behind his sneaker. After was an event for the shoe release at FourTwoFour On Fairfax. Videographer/ Photography: Allen Park\n"},
{"url": "http://www.alealimay.com/blog/2014/10/26/apc-melrose-place-opening-party", "_id": {"$oid": "559be2b665f2886d5687b9aa"}, "extracted_text": "IA\nThursday, October 23, 2014, A.P.C. invited me to the celebration of their opening -  A.P.C. Melrose Place .  DJ's Troy Von Balthazar and Charlie Eisner set the vibes that night.  Here's a small recap as the crowd overflowed the store.  Founder Jean TouiTou was accompanied by Kanye West to help bring in the celebration along with Jerry Lorenzo, Ian Connor, Shane of Midnight USA, Kilo Kish, and many others. \n \n"},
{"url": "http://www.bryanboy.com/bryanboy_le_superstar_fab/2004/11/gangbanged_by_n.html", "_id": {"$oid": "559be2b765f2886d5687b9ab"}, "extracted_text": "November 12, 2004 — comments 2\nGangbanged by Navy Cadets\nWritten By bryanboy\nAfter going to Pushkin Palace, the boys decided to throw a little indoor goodbye party for me at the hotel. We went to a real Russian market, bought some food, some caviar (US$30 for 1 kilogram), then to a supermarket to buy some booze, then called a special \"someone\" to get some \"stuff\"… if you know what I mean. ;)\nAs soon as we got into my room, bam!!! Fun, fun, fun!. I had 2 of the boys try on some my stuff cause they all looked like gansgters in black. LOL. I asked Poletay (see below) to try my Dior boots on and another guy to try my fox jacket and pose like a pimp.\nPoletay in my Dior snow boots\nGuess what happened next? ;)\n"},
{"url": "http://www.alealimay.com/blog/2014/10/4/new-york-fashion-week", "_id": {"$oid": "559be2b965f2886d5687b9b5"}, "extracted_text": "IA\nNew York fashion week is always a great idea! So many beautiful clothes to see in such a short period of time. Hood By Air, Tim Coppens, Alexander Wang, and Rochambeau were few of the many shows I attended.  It's always hard to save battery on your phone when you're trying to take as many pictures as possible. Enjoy :)\n"},
{"url": "http://www.alealimay.com/blog/2014/11/11/alexander-wang-x-hm", "_id": {"$oid": "559be2ba65f2886d5687b9b7"}, "extracted_text": "Windproof Jacket\nBoots\nAlexander Wang's collaboration with H&M has by far set the standard for any collaboration with H&M.  With collabs such as Versace, Maison Martin Margiela, Isabel Marant, and Lanvin, H&M reigns supreme when fusing high end designs with affordable prices that reach to the masses.  Neoprene, black, and more neoprene, and more black!  As one of my favorite fabrics and colors, Wang scored a perfect 10 in my book.  The collection is so parallel to my personal style of being sporty-chic, I just couldn't resist!\n"},
{"url": "http://www.alealimay.com/blog/2014/11/20/los-angeles-auto-show-2014", "_id": {"$oid": "559be2bb65f2886d5687b9b9"}, "extracted_text": "Aleali May\nThe Los Angeles Auto show is a convention that happens every year.  The last time I could remember attending the LA Auto show, I was too young to know the significance of car brands, details of interiors and the need for speed.  Yesterday was a great reminder of that.  From working with Audi USA on the #PAIDMYDUES campaign to owning my first luxury car, being an Audi, I shared my LA Auto Show experience with none other than the Audi team.  Audi's new head of design in Germany spoke for the first time and unveiled a concept car, the A9.  There was also the latest and fastest R8 ever and the all-new TT on the show floor.  Infiniti, Mercedes Maybach and Porsche were few of the many other luxury cars that accompanied the showroom.  @JoeyBrezinski  , @ChristianRich , and  @GuillermoAndrade  were in attendance as well.  The night ended at the London West Hollywood as Audi hosted a party to celebrate the unveilings and years of success.  I enjoyed every bit of it!\nSpecial thanks:\n"},
{"url": "http://www.alealimay.com/blog/2014/11/3/nike-sneakerboots", "_id": {"$oid": "559be2bb65f2886d5687b9bc"}, "extracted_text": " \n\"BE WARM. BE DRY. BE SEEN.\"\nNike #Sneakerboots are one of many Nike shoes that provide comfort and protection.  Six Los Angeles natives (including myself), were able to live the day in sneakerboots while capturing its essence for Nike Sportswear.  With different shapes, colors, and textures, everyone soon learned about the various styles of the sneakerboots.  As you can see, Nike does a phenomenal job of revolutionizing sneakers.  It's more than just a shoe, it shows a way of life, and learning how to be prepared!  Here's a recap to share my experience of what went down that Saturday, fast forward to seeing the finishing product at Blends LA in downtown Los Angeles. Enjoy! \nInfluencers: @alealimay @uniformjournal @callmemshunter @mateodynt @ariellev @johnhicks \nMakeup: @emanmakeup\nVideo & Photography: @allbyallen @kidfuture_ @ravivora @nikesportswear\nApparel: @nikesporstwear \n"},
{"url": "http://www.alealimay.com/blog/2014/11/5/vibes-by-theophilus-london", "_id": {"$oid": "559be2bc65f2886d5687b9be"}, "extracted_text": "IA\nCongratulations to my friend @TheophilusLondon for a great album!  The title, \"Vibes\" is self-explanatory.  The album was executive produced by Kanye West.  The artwork and photography was taken by icon Karl Lagerfeld.  \"Vibes\" provides nothing less than high quality rhymes, rhythms, beats, and fashion!  I first met Theo about three years ago at a Been Trill x Hood By Air brunch in New York.  It was my first fashion week ever attended and I was so excited to be in the streets, seeing everyone dolled up for these fun-filled days of endless runways and fashion parties.  Three years ago, Theo still had his solid silhouette of large hats and high end tops with jeans and boots.  It was almost intimidating to meet someone with so much style, I knew I had to come correct.  Since then, I noticed Theo in Karl Lagerfeld's \"Little Black Jacket\" book, attending runways in Paris, and on the regular television in car commercials... even the video presentation for Apple's iPhone 6 on apple.com.  Theo has been a great mentor and friend and has always done everything with so much swag!\nI had the opportunity to be apart of Theo's album, \"Vibes\".  He called, wanting me to hear the album and while sitting there amazed by the records, he asked to make my voice one of the official \"Vibes\" sample voice overs.  I had never done special FX, nor was I rapper (haha). Virgil Abloh and Benji B. then triggered all album sound-bytes.  So if you listen to songs like \"Water Me\" and \"Get Right\" and hear a calm voices repeating \"vibessss\", you know that's me!  \nTheophilus London's new album Vibes, available HERE\nStream the album HERE\n"},
{"url": "http://www.alealimay.com/blog/2014/12/18/acne-studios-one-year-anniversary", "_id": {"$oid": "559be2bc65f2886d5687b9c0"}, "extracted_text": "Aleali May\nIn the Eastern Columbia building downtown Los Angeles, ACNE Studios had their one year anniversary party.  Drinks were served and the vibes of the party were brought to you by Haim.  Such an amazing night around creatives!  The downtown Los Angeles area has recently become very popular as cool stores open and young adults are finding this area to be home.  Can't wait to see what the downtown area will become in the near future. Thank you so much to the ACNE Studios team for the invite, here's a recap of the celebration. Enjoy!\n \n"},
{"url": "http://www.alealimay.com/blog/2014/12/21/fear-of-god-la-holiday-shop-at-h-lorenzo-gallery", "_id": {"$oid": "559be2bd65f2886d5687b9c2"}, "extracted_text": "Aleali May\nFear of God Los Angeles by Jerry Lorenzo  has recently opened a holiday shop on Sunset Blvd. at one of the best stores in LA,  H. Lorenzo .  J. Lorenzo for H. Lorenzo opened early this week as supporters had the opportunity to purchase the newest collection of Fear of God LA, along with some exclusive pieces just for the pop-up.  Since the launch of the first collection leading to the recent release of the third collection, the brand has soared!  It is now being sold in boutiques and stores across the world such as Barney's New York .  The brand is infamous for its essentials, which include basic tees, flannels, crew necks and hoodies with side zippers, bomber jackets and overcoats, along with sweat shorts and pants.  Quality is great! Minimalistic but still very detailed!  With Jerry as one of my big brothers in fashion, I had the opportunity to wear some of the third collection pieces prior to the release in my interview for HYPEBEAST .   I personally wear Fear of God LA on a regular basis and they are some of the best pieces in my closet.  The shop is open December 15-21st, but always available at retail stores and online at FearofGodLA ... if it's not sold out (HA!).  Last nights event was a celebration for the holiday shop with friends and family.   Drinks provided by Hennessy.  Vibes provided by Bradley Soileau, the infamous model in your favorite Lana Del Rey videos and one of the faces for Fear of God LA.   Here's a recap, event pics below. Enjoy!\nPhotography: Allen Park\n"},
{"url": "http://www.alealimay.com/blog/2014/12/30/aleali-mays-top-5-moments-of-2014", "_id": {"$oid": "559be2bd65f2886d5687b9c3"}, "extracted_text": "FIVE DAYS WITH FLEUR DU MAL\nTHE COVETEUR: ALEALI MAY\nHYPEBEAST.COM INTERVIEW: WOMEN IN STREETWEAR AND THE INTERNET GENERATION\nALEALIMAY.COM\nThere have been so many opportunities presented this year and they were all great experiences.  I've learned so much this year and look forward to what 2015 has to offer.  Here are 5 of many moments I've enjoyed in the year of 2014.  Thank you to everyone's love and support, I couldn't have done it without anyone involved in each of these moments.  \n5. Five Days with   Fleur du Mal  was an instagram blast of their latest lovely leather bra.  Each day there was a post on different outfits wearing the leather bra. The quality of all the brands pieces are amazing and comfortable.  Fleur du Mal is fun, flirty, a little dirty and so sexy! They specialize in dressing up and underdressing. Ladies if you haven't heard, please visit their site!  This was exciting as I worked with film photographer, Christina Paik.  Every time we come together its always magic being made.  \nPhotography:  Christina Paik\n4. The Coveteur interview was probably the quickest shoot I've done, and by far one of the most personal, showcasing my closet, my style, and items I've grown an attachment to.  I was so ecstatic for this opportunity to be on The Coveteur next to some of my idols in fashion such as Pharrell , Anna Dello Russo and Olivier Rousteing of Balmain .  \nAleali for The Coveteur\n3. HYPEBEAST.COM Interview was an interview to voice my opinion and answer questions about women in street wear and fashion trends amidst the digital generation.  This interview was unlike any interview I've done before.  It hit close to heart as being a women in the street wear world is still new and improving.  Women are making their mark everyday whether it's in or out of the street wear culture, and everyones contribution counts.  The digital generation is also new and the pros and cons of the internet bring up so many questions about where will this all go... are we moving too fast? Can we keep up? So many questions!!! \nAleali May for Hypebeast  \n2. Audi USA presents their first social media campaign called #PaidMyDues.  More than 15 creators, artists, musicians, filmmakers, and performers shared moments of how they paid their dues.  The footage was live one day in the month of May as we sat and watch everything in full effect at a Santa Monica Airport Hanger.  The campaign was brought to you by the latest model of the Audi A3 2015.  The Audi brand is from Germany, and showcases their roots through sleek designs, premium interior and need for speed.  Ever since the Audi campaign, I was persuaded to own an Audi... sooooo, I got one (LOL).  It's amazing to say the least and their customer service is top notch! Not only are they interested in making better cars, they're interested in the consumer!  \n Aleali for #PaidMyDues  \n1.  ALEALIMAY the site.  This has been the best accomplishment of 2014 for me, as I launched this site a couple months ago.  It took so long to actually put this into fruition but we're here!  Without photographer @AllbyAllen and many others that contributed to this site, it wouldn't showcase my vision as great it does.  On here I showcase events I attend, places I go, my experiences and outfits.  I mean, no need to write too much on what blog is about... cause I've placed it in the ABOUT section (HA!).  Thank you again for everyones support and tuning in every week. Love!\nAleali May for AlealiMay.com  \n"},
{"url": "http://www.alealimay.com/blog/2015/1/19/article-n-shoe-release-event", "_id": {"$oid": "559be2bf65f2886d5687b9c9"}, "extracted_text": "Aleali May\nArticle N ̊ (article number ) . A new luxury shoe brand that is comfortable, fashionable, and made with quality. Ranging in different styles from high-top to low-top, different colors and materials,  silhouettes of Article No. may remind you of some of your favorite sneakers from the past. Made in Los Angeles, but known internationally, Article No. is found in many stores overseas such as Colette, United Sons and Arrows and Barney's New York to name a few.  The event was held at FourTwoFour on Fairfax with sounds by Max V and drinks by House Beer.  \nMore info on Article Number: HERE   \n"},
{"url": "http://www.alealimay.com/blog/2015/1/7/hm-presents-everyday-icon-aleali-may", "_id": {"$oid": "559be2c065f2886d5687b9cd"}, "extracted_text": "Aleali May\nH&M Life presents their special segment called \"Everyday Icon\".  The segment includes interviews as well as photos of women from different cities with amazing style!  Honored to be one of these women, Adam Katz of Le21eme, shot these photos of me in my hometown, Los Angeles.  \nLook 1: Y-3 Flannel, Maison Martin Margiela Leather Leggings, Camper Sneakers, Gucci Mask Sunglasses\nLook 2: Bathing Ape Button Down, Ksubi Denim, Vans Vault Leather Sk8 Hi & Givenchy Bag\nLook 3: Army Surplus Zip Up, Acne Studios Denim, Fendi Sunglasses, Patrick Mohr Sneakers, Hermes CDC Bracelet\nLook 4: Homme Boy Graphic Tee, Acne Jeans, Jordan 1 OG \"Royal\" \n"},
{"url": "http://www.alealimay.com/blog/2015/2/17/urban-outfitters-interview-about-aleali-may-x-allen-park", "_id": {"$oid": "559be2c065f2886d5687b9ce"}, "extracted_text": "Aleali May\nUO PREVIEW : \"This month at UO, we're inspired by duos of all kinds, whether it's couples or coworkers, bandmates or brothers: sometimes the best, most unexpected results come from the power of two, and we're diving into these stories to learn more about lots of different pairs. One of our favorite discoveries is the creative collaboration of Aleali May and Allen Park. A stylist force to be reckoned with, Aleali has her hands in tons of different compelling facets of the fashion world, from her start working with clothing brands as a teenager to today working as a stylist and image consultant. On the other side is her partner in crime Allen Park, who shoots the editorials that Aleali styles for her blog and is the behind-the-scenes man turning her ideas into reality. One afternoon in LA, we decided to flip the lens and pair them together for a shoot reflective of their signature minimal-modern style, having them both put their own twist on some of our favorite black and white UO pieces, and divulge more about their personal style. \"\nOutfit 1: Fear of God LA Flannel and Muscle Shirt, Rick Owens Black Shorts over UO  \"Out From Under\"  Black Leggings, and Vans Vault White Leather Vans \nOutfit 2: Theory Leather Jacket over UO   \"Tee Library A Picture\"  Shirt, Venus x Mars Sweatpants, and Air Jordan 1's\nMore images and the full interview HERE\n \n"},
{"url": "http://www.alealimay.com/blog/2015/2/25/stussy-women-ss15-lookbook-featuring-aleali", "_id": {"$oid": "559be2c165f2886d5687b9d0"}, "extracted_text": "Aleali May\nStreet Grunge.  Stussy introduces a series of classic photos for their Women's Spring/Summer 2015 lookbook.  The series originates from the Stussy Japan chapter, in which I was one of two models to bring in the new threads.  Blessed to model for such a classic brand, Stussy is an O.G in the street wear world.  The photoshoot was a day of funky colors and fun on Venice Beach, California! Check out more Stussy vibes on Stussy.com  \nPhotography: Yusuke Yamatani\n"},
{"url": "http://www.alealimay.com/blog/2015/2/6/louis-vuitton-series-2-exhibition-los-angeles", "_id": {"$oid": "559be2c265f2886d5687b9d2"}, "extracted_text": "Aleali May\nYesterday evening in Los Angeles, Louis Vuitton invited me to their \"Series 2\" Exhibition.  All guest had a chance to discover a presentation of the timeless inspirations behind Louis Vuitton's new collection.  Filled with seven different rooms that cherished Louis Vuitton's past, leading up to the present day of Spring/ Summer 2015 Ready-to-Wear collection, and the future of LV.  Rooms include a recreation of access to a backstage runway and the show, a poster room, and gallery of trunks and accessories.  My favorite room was the \"Talking Faces\". I admired each room of the exhibition as it brought back memories of working for Louis Vuitton.  The exhibition is open to the public February 6th through the 22nd at 1135 North Highland Avenue.  I encourage everyone to see it if in Los Angeles!\n \n"},
{"url": "http://www.alealimay.com/blog/2015/3/16/known-gallery-presents-iyou-heshe-itwe-they", "_id": {"$oid": "559be2c265f2886d5687b9d4"}, "extracted_text": "Aleali May\nKNOWN GALLERY PRESENTS: I/YOU, HE/SHE, IT/WE, THEY\nCurated by (Kilo) Kish Robinson, Blanda, and Silke Labson, the art gallery opening was held at Known Gallery on Fairfax.  Film pics, paintings and other pieces showcased their individual talents.  The youth supported the movement with sounds by SOSUPERSAM and Samantha Urbani.  The gallery is open from March 14-18!  Be sure to check it out. \n"},
{"url": "http://www.alealimay.com/blog/2015/3/20/sweat-the-style-featuring-aleali-may", "_id": {"$oid": "559be2c365f2886d5687b9d6"}, "extracted_text": "SWEAT THE CREW\nSWEAT THE LOOK: THE LOCKER ROOM \nSweatTheStyle.com is a lifestyle site that focuses on sports fashion, fitness, health and more!  Adrianne Ho , model and founder of Sweat The Style showcases not only herself, but other women with similar lifestyles in a section of her website called Sweat The Crew .  Honored to being featured for STC, Adrianne shot photos of me in my favorite Rick Owens vest, Rick Owens Sweats, Nike Lab Air Force 1's and Adrianne's \"Sweat\" active wear.  We had a great time working as I really enjoy seeing women of similar interests create together! The images on your right are from The Locker Room's Vintage editorial featuring myself.  Styled with  For All To Envy's vintage pieces, I chose to shoot in this Lakers jersey, Jordan crew neck, Adidas jacket, Ice Cube and Mike Tyson tee as they are most relatable to my background of being from Los Angeles, a huge fan of sports and more in depth, Michael Jordan.  You can purchase any one of these awesome pieces and others from  The Locker Room ! \nMore photos from my Sweat The Crew and The Locker Room shoot  HERE\n \n"},
{"url": "http://www.alealimay.com/blog/2015/3/24/elle-girl-japan-featuring-aleali-may", "_id": {"$oid": "559be2c365f2886d5687b9d8"}, "extracted_text": "Aleali May\nELLE Girl Japan's May 2015 issue is one to remember. With Kendall Jenner on the cover, Los Angeles is one of Elle Girl JP's main focuses.  With this special feature, you'll find Sofia Richie, Haim, Hanna Beth and I, as your tour guides through LA.  We each showcase some of our favorite spots to shop, eat, hang out with friends, and exercise!  \nMy two page spread takes you to Four Two Four on Fairfax, General Store and Cafe Gratitude in Venice Beach, Arcana: Books On The Arts store, Union Los Angeles, and Known Gallery.  With a few more suggestions on the bottom, exercising at Runyon Canyon early in the morning, shopping at RIF Los Angeles for sneakers, and ending the day with friends at The Darkroom is always a great plan.\nELLE GIRL JAPAN HERE  \n"},
{"url": "http://www.alealimay.com/blog/2015/3/26/nike-air-max-day-2015", "_id": {"$oid": "559be2c465f2886d5687b9d9"}, "extracted_text": "Aleali May\nMarch 26th is marked as a worldwide celebration for Nike's infamous Air Max Shoe.  Yesterday, I was invited to a VIP private event with six other Nike Women influences to celebrate Nike Air Max Day.  Through this experience,  we had the chance to reunite or meet with legendary designer and the man who started it all, Tinker Hatfield.  Nike also brought their Air Max Box to hold the event in.  The last time we saw the Air Max Box in the United States was earlier this year in New York for All Star Weekend.  Nike Air Max fans have been celebrating this special day throughout the world, and it all ended here in Los Angeles at this special event titled \"The One Before The 1\".  There were sneaker heads, designers, influencers and many others that joined in on this experience.  We were also gifted a special pair of Air Max shoes as I got my personal Nike iD Air Max's signed by Tinker!  He spoke about the process of the Air Max and the evolution.  Caterers, manicurists, artists, infamous sneaker cleaner guru, Jason Markk and his crew were also in attendance which assisted in making our Nike Air Max Day one for the books.  It was such a great experience and definitely a learning one!  Thank you Nike!\n \n"},
{"url": "http://www.alealimay.com/blog/2015/3/29/diesel-tribute-by-nicola-formichetti-at-h-lorenzo", "_id": {"$oid": "559be2c465f2886d5687b9da"}, "extracted_text": "Aleali May\nH. Lorenzo's Robertson Blvd. location invited myself and others to celebrate the launch of \"DIESEL TRIBUTE\" by NICOLA FORMICHETTI for H. Lorenzo.  The event took place Friday 27, March 2015.  Grooves provided by DJ XO-Chic. The crowd grew larger throughout the night as I bumped into so many familiar faces.  I always love attending H. Lorenzo events in reason being that not one person is alike, and it is boldly stated through each individual's outfit and style.  The \"Diesel Tribute\" included bright colors of neoprene material and blue denim, being a perfect match for these past warm weeks here in Los Angeles.  Between the music, guests, and cocktails, this event was nothing less than awesome!  \nPhotography: Allen Park\n"},
{"url": "http://www.alealimay.com/blog/2015/3/3/travi-scott-x-young-thug-rodeo-tour-1", "_id": {"$oid": "559be2c465f2886d5687b9db"}, "extracted_text": "Aleali May\nAttending Travis Scott and Young Thug's first show of their \"Rodeo Tour\" was insane!  Two dope artist on one stage, let alone a whole tour is something that shouldn't be missed.  Metro Boomin' and OG Chase B topped it off by spinning the set with complimenting next level visuals for Travis and Thugger.  Backstage you'll see them, Mike Carson, Sickamore, Birdman, Easy Otabor, and many others from each artists' camp.  Let's not forget how fashionable the crowd, artists, and backstage looked.  Supreme, Bathing Ape, Vans, Jordans... you name it, it was worn.  Again, if their in your city, don't sleep!  Enjoy the recap :-)\nTour Dates x Cities: http://travisscott.com   \n"},
{"url": "http://www.bryanboy.com/bryanboy_le_superstar_fab/2004/11/excuses_and_whi.html", "_id": {"$oid": "559be2c565f2886d5687b9de"}, "extracted_text": "Written By bryanboy\nMy friend Jane wanted to bring me to this club called Caligulla but I told her I’m gonna call off the night because I had to wake up early tomorrow. I know myself when I go clubbing — I drink an awful lot, do some stuff and dance till it’s 6 or 7 in the morning.\nPrevention is better than cure.\nSo off I went to the hotel, checked my emails a little bit and then Mark’s friend Valery called me to checked what I was doing. She said she had 2 friends who wanted to see me and asked if they can drop by at my room and maybe we can all have a chat. I said ok — as long as we’re not going out etc cause I had to wake up early tomorrow.\nFast forward 1 hour later, Valery, Natasha and Yulia (the one with the blonde bangs) arrived.\nAll girls are soo soo fun. Natasha’s english is great. Whereas Yulia… oh my god, Yulia is just like \"Bubbles\" from Absolutely Fabulous. She’s one crazy girl – she’s a journalist of some sort for some Russian Music/MTV-like channel. She likes to make these little facial things which are sooo cute. I have this body shimmer powder thing and we played around with it like little teenage girls. LOL.\nNatasha, Moi, Yulia at my room\nYulia, Natasha, Valery\n"},
{"url": "http://www.alealimay.com/blog/2015/3/30/travis-scott-x-young-thug-rodeo-tour-los-angeles", "_id": {"$oid": "559be2c765f2886d5687b9e5"}, "extracted_text": "Aleali May\nWith only a few shows left of the Rodeo Tour, Travis Scott and Young Thug blessed Los Angeles with two back to back shows on March 28th.  Right before the two performed together to close the show, Young Thug brought out Birdman, while Travis brought out big brother, Kanye West.  If you made the 11pm show, you got to experience all of this on one stage.  Even Chris Brown joined in to the chanting of Kanye West's new song, \"All Day\"!  The guest list of Rodeo Tour survivors included superstars like Rihanna and friends of mine, SZA, Odd Future's Taco, Hit Boy, Jerry Lorenzo, Easy Otabor, and Ibn Jasper.  So many personal style icons under one roof as camouflage and Yeezy Boost sneakers seemed to be the night's uniform. The crowd roared together in a mosh pit to the vibes held down by Metro Boomin' and OG Chase B.  What a night!\nVideo/Photography: Kevin G. #shotbykvng\n"},
{"url": "http://www.alealimay.com/blog/2015/3/9/nike-run-club-los-angeles", "_id": {"$oid": "559be2c765f2886d5687b9e6"}, "extracted_text": "Aleali May\nSunday, March 8th, I celebrated International Women's Day with Olympic medallist Carmelita Jeter and music icon Ellie Goulding, followed by a Nike+ High Intensity Training & Run session to start the Journey to Nike Women LA. As one of seven ladies chosen to kick off the program, this is our second intense workout which focuses on running.  Val's plank, Ashley's perfectly pointed toes and some stretches before and after the exercise was necessary! Thanks Nike Women!\nPhotography: Allen Park\n"},
{"url": "http://www.alealimay.com/blog/2015/4/12/coach-backstage-event-coachella", "_id": {"$oid": "559be2c765f2886d5687b9e7"}, "extracted_text": "Aleali May\nCoachella weekend one was everything! Stuart Vevers invited myself and friends to Coach Backstage event featuring ECHOSMITH.  Taking place at the Soho Desert House, the vibes were so relaxing as food and drinks circled around to teepee lounge areas, boats, and poolside set-ups.  It was a great way to kickoff the weekend under Coach umbrellas, pillows and picnic blankets.  If only I could take a few of the pillows home (LOL!).  \nPhotography: Allen Park\n"},
{"url": "http://www.alealimay.com/blog/2015/4/12/midnight-studios-ss15-release-at-424-on-fairfax", "_id": {"$oid": "559be2c865f2886d5687b9e8"}, "extracted_text": "Aleali May\nShane Gonzales, founder of Midnight Studios celebrated his Spring/Summer 15' launch called \"Something Else\" at Four Two Four on Fairfax last night.  As one of the youngest new designers, Shane is making an impact in fashion with Midnight Studios, and has a whirlwind of supporters behind him.  The Youth and the internet generation overflowed each room as kids got a chance to purchase Spring/Summer 15' pieces.  Shane catered to his clients by personally screen printing each t-shirt with the Midnight logo.  Sounds were brought to you by DJ SKKRRT which guaranteed the perfect experience with Shane's aesthetic.  \nMidnight Studios S/S15' HERE\n"},
{"url": "http://www.alealimay.com/blog/2015/4/21/sweat-the-crew-pt2-featuring-aleali-may", "_id": {"$oid": "559be2c865f2886d5687b9eb"}, "extracted_text": "Aleali May\nIn the Sweat The Crew section on Adrianne Ho's SweatTheStyle.com, I featured another look using Adrianne's \"Sweat\" gear.  I paired it with my Los Angeles Kings Starter Jacket, an inside-out Hip Hop tee and my favorite Jordan 1's.  My other fit being a Jerry West jersey, Nike sports bra, and Supreme Air Force 1's.  Hope you like! :-)\nSweat The Crew: HERE\n"},
{"url": "http://www.alealimay.com/blog/2015/4/8/aleali-may-x-emanuele-dangelo", "_id": {"$oid": "559be2ca65f2886d5687b9ee"}, "extracted_text": "Aleali May\nOriginally from Rome, Emanuele D'Angelo, also known as \"Livin' Cool\" via social media, snapped some photos of me while visiting Los Angeles.  Taking place at the Sheats Goldstein Residence,  we captured not only myself, but also Goldstein's personal James Turrell structure hidden in his jungle and views of the city.  Just an average day hanging with friends and capturing the moment. Enjoy! \n"},
{"url": "http://www.alealimay.com/blog/2015/5/19/beats-by-dre-presents-wondaland-the-eephus-listening-event", "_id": {"$oid": "559be2ca65f2886d5687b9f0"}, "extracted_text": "Aleali May\nMay 14th, Beats Presents: Wondaland - The Eephus Listening Event.  The event was hosted by LA Reid and Janelle Monae at Sayers Club in Los Angeles.  Janelle introduced her new label, The Eephus, and all artists under her label.  Each artist got a chance to perform a single, and the crowd enjoyed every bit of it!  The vibes were a mix of Jazz, Hip-Hop, R&B, and Soul.  Don't underestimate the suit and ties in the pictures above, Janelle's got the new talent that can definitely turn up!  \n"},
{"url": "http://www.alealimay.com/blog/2015/5/26/a-trip-to-dakar-senegal", "_id": {"$oid": "559be2cb65f2886d5687b9f1"}, "extracted_text": "Aleali May\nDAY 1: THE ISLAND OF NGOR\nThe first day landing in Senegal, I visited the island of Ngor.  Traveling by boat to the island, we had a traditional Senegalese meal that included fish, rice, chicken, a sauce containing onions and carrots, and beer.  On the island, there were many locals that sold art, handmade jewelry, and clothing from traditional fabrics.  The streets were tagged with graffiti art and paintings that expressed the minds of the locals.  Ngor is known for its laid back environment and is the home to many surfers.\nDAY 2: THE ISLAND OF GORÉE\nI had the privilege of visiting the island of Gorée.  The island is known for its astounding history.  Our friend, born and raised on the island of Gorée, gave us the insiders tour.  My favorite and most emotional part about the island was visiting the House of Slaves.  The place where over 12 million slaves were shipped all throughout the Americas, Caribbean, Dominican Republic, Cuba, and many other places.   We had a chance to stand in each room where the slaves were separated by sex and age.  Reflecting on the conditions and seeing the Door of No Return, made it emotional for everyone.  The Door of No Return reflects the moment the slaves were shipped away, to never see their homes again. It also reflects the slaves that did not make it onto the boat due to illness, in which they were thrown out into the water, where they couldn't survive.  Today it is a landmark and one of the most talked about places in your school history books when referring to this time in history.  There are also monumental canons around the island in which we met a few men selling their sculptures and paintings.  Art on the island of Gorée is everywhere, and just like America, they absolutely love Tupac! This was one of my best days spent in Dakar, Senegal.  I could never forget this day.\nDAY 3: CHEZ SALIM - LAC ROSE & The Seed Project's Culture Night\nLac Rose, also known as the Pink Lake, was once a lake filled with fish.  Later, the fish ended up disappearing one by one and the lake produced salt.  With the position of the sun and also the salt, the lake can give off the same effect of pink lemonade (but not as delightful if you drink it).  Men and women gather buckets and boats of salt and divide them into sections on the shore.  Most of the salt is exported and used in cities that need salt for the ground, to disintegrate the ice on the sidewalks.  We visited the nearby villages, sand dunes and the beach.  This whole journey was brought to us by four wheelers and a tour guide.  Crops of mint and turnips grew in between villages, with even a fresh water supply dug from the ground.  After the festivities, we ate on the shores local restaurant and later attended culture night at The Seed Academy.\nDAY 4 & 5:  THE SEED ACADEMY \nThe Seed Academy is a non profit organization that runs an academy for young boys and girls.  They use basketball and education as their platform to prepare opportunities in Senegal.  With both education and talent, kids are prone to opportunities outside of Africa with scholarships and many more benefits.  The days spent with the Seed Academy were amazing.  The kids had been working hard and playing against each other all season in basketball games called the Hoop Forum.  For lunch that day, we had a traditional Senegalese meal with local drinks of ginger, chicken and sautéed onion, and rice.  The last day held the final game at the Marius Ndiaye Stadium.  East won vs. West as NBA players Wilson Chandler of the Denver Nuggets and Gorgui Dieng of the Minnesota Timberwolves helped coach both sides.  The Seed Academy showed so much love and were great hosts during my stay in Senegal.  This isn't a farewell message, 'cause I'll be back!\n"},
{"url": "http://www.alealimay.com/blog/2015/5/3/soulection-at-the-regent", "_id": {"$oid": "559be2cb65f2886d5687b9f3"}, "extracted_text": "Aleali May\nThis passed Saturday, May 2nd, Soulection hosted a show at The Regent Theatre in Downtown Los Angeles.  Soulection is a group of creative music makers. The sounds of each individual in the group consist of a soulful, contemporary mix.  Using classic throwbacks and mixing it with sounds of music genres in indie, R&B, and funk, Soulection has gained a great audience.  Saturday, the line up included Andre Power, Joe Kay, So Super Sam, Towkio, Andres, and their special dj guest all the way from Wales, UK.  The crowd enjoyed the vibes, and so did I!\nPhotography: #Shotbykvng x VZmaestro\n"},
{"url": "http://www.alealimay.com/blog/2015/5/7/2d0qvog2st69dz9ys15qfci0hx1zsy", "_id": {"$oid": "559be2cb65f2886d5687b9f4"}, "extracted_text": "Aleali May\nYesterday evening was the celebration of skate company, HUF and G-Shock's new watch.  The black embossed wristband added a new look and feel to the classic silhouette of the G-Shock watch.  The party was held at Avalon Hollywood in Los Angeles with vibes by legendary Harlem group, DIPSET, which includes FreeKey Zekey, Juelz Santana, Jim Jones, and Cam'ron.  Plenty of faces in the crowd as some of the attendees included original street gurus, Gee and clan from Crooks n' Castles, Mega and family from BlackScale, HUF, Hellz Bellz, Union LA, Jerry Lorenzo of Fear of God, and plenty others.  The night was lit! Enjoy the recap :-)\n"},
{"url": "http://www.alealimay.com/blog/2015/6/15/klassic-summer-fest", "_id": {"$oid": "559be2cc65f2886d5687b9f5"}, "extracted_text": "Aleali May\nSaturday, June 13, 2015 I attended the KLASICK Summer Festival.  The festival was held in Santa Barbara in a classic Rodeo setup which headlined Travi$ Scott, Curren$y, Ty$ Sign, and Schoolboy Q.  The crowd vibed to each performer as security couldn't quite handle some of the raging fans.   The show hosted some of the most fashionable artists as you can see loads of jewelry, cameos of BAPE, Vans, Supreme and band tees.  Enjoy the recap :)\n"},
{"url": "http://www.andigetdressed.com/2010/05/friday-fix.html", "_id": {"$oid": "559be2ce65f2886d5687b9ff"}, "extracted_text": "May 14, 2010\nFriday Fix\nT-Bags is one of my favorite brands and I just snagged this fantastic one shoulder tunic dress from Saks.com. The necklace comes with it! (yay) Unfortunately I'm really good at justifying my purchases...\nJustification #1, it's Friday and isn't Friday the most indulgent day of the week? I mean really...you eat pizza for lunch, have drinks after work, make unnecessary purchases...\n#2 It's on sale! Need I say more?\n#3 Because of my work there are so many events to attend and wouldn't it really be remiss of me to not buy this as I may have an event or outing pop up and I'll have nothing to wear and won't go thus missing out on some amazing work opportunity having not met a great contact?\nSee? I need this.\n"},
{"url": "http://www.andigetdressed.com/2010/05/why-fatshion-insider.html", "_id": {"$oid": "559be2cf65f2886d5687ba01"}, "extracted_text": "Why Fatshion Insider...?\nA bit of an intro if you will...\nI've been working in fashion & entertainment for nearly 10 years and as a plus size, African American female you can guess that my journey has at times been quite interesting.\nHaving worked with fashion brands & retailers both plus and straight size, I've had the chance to see the industry change quite dramatically over the last few years and it's exciting! As a publicist I've worked with magazines including InStyle, Glamour, O the Oprah Magazine and many others but I'd really love to see more than one \"curvy girl\" outfit on 300+ pages.\nMy goal is to share some of my adventures, fashion that I love and where to find it...There's SO much more fashion available for sizes 10 and larger these days (no excuse for boxy tees and pleated khakis). I'll begin posting in the next few days - Follow me :)\nxo,\n"},
{"url": "http://www.andigetdressed.com/2010/07/i-really-do-heart-ronson.html", "_id": {"$oid": "559be2cf65f2886d5687ba02"}, "extracted_text": "July 7, 2010\nI really do *heart* Ronson\nI've been a very naughty girl...I've become addicted to updating via Facebook. Sorry blogspot heh. Well it's been a while but I had such a fun experience on a very random and unexpected trip to JCPenney that I needed a little more room to express myself than Facebook allows.\nSo here goes...my good friend and stylist Meeka Johnson is great for hipping me to stores I either have never checked out or wouldn't give a chance. Case in point...JCPenney. I'd never go in there, no offense just not my speed, or so I thought. She popped up with bags FULL of really cool clothes from the mega retailer that I would have never ever...ever guessed came from \"Penney's\" as we call it. Meeka is a 5'9 curvy girl but not exactly plus size but she encouraged me to check out JCPenney's I Heart Ronson, Bisou Bisou, She Said... and others. They aren't plus brands but I found a few really cute things that fit and are super cute! My little sis came along for the ride and found a great fushia rumper and harem pants on the clearance rack. Love it! I'll post pics of me in some of the outfits soon.\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/07/lifes-beachor-is-that-peach.html", "_id": {"$oid": "559be2cf65f2886d5687ba03"}, "extracted_text": "July 28, 2010\nLife's a beach...or is that peach?\nJust got back from the incredible Turks & Caicos islands had a blast...just a super quick posting of what I wore on one of my fav days running back and forth from the beach to the pool with my sis. She acutally saw this swimsuit and grabbed it for me...normally letting someone else buy you a swimsuit is a BAD idea but baby sis knows me oh so well. It fit great and was super cute :) (I think anyways)...The sarong I got from a very random and slightly sketchy open market in Jamaica earlier this year where along with the sarong the man tried to sell me some \"smoke\" lol.\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/07/ootd-heat-wave.html", "_id": {"$oid": "559be2d065f2886d5687ba04"}, "extracted_text": "July 16, 2010\nOOTD - HEAT WAVE!\nIt's really, really hot in NYC. It's hard to wear anything beyond a cotton dress. Here's what I wore today. A simple black cotton dress from Old Navy which I love! I think I'm going to venture into linen shorts this weekend...We'll see ;)\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/back-to-basics.html", "_id": {"$oid": "559be2d065f2886d5687ba05"}, "extracted_text": "October 26, 2010\nBACK TO BASICS\nMy lifestyle has changed dramatically and thus, my wardrobe. I have so many \"fancy\" clothes...being a fashion/entertainment publicist does require a good amount of going out but because I work for myself and not a corporate office anymore, I get to rule my wardrobe the way that I like. Basics are hard for me because they are usually a bit boring but I challanged myself to scope out a site that I feel is nothing but basics, Old Navy. Much to my surprise, some pretty cool pieces! Here are a few standouts.\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/blackout.html", "_id": {"$oid": "559be2d065f2886d5687ba06"}, "extracted_text": "October 27, 2010\nBlackout\nHad a blast Monday night at the Hudson Hotel's Turntables on the Hudson with DJ Quest Love. I managed to remember my camera and was so excited to see the party had moved to the basement which had an incredible lounge filled with dope furniture and artwork. You can imagine my dismay when I realized I left my memory card in my laptop. Luckily I was able to snap a few shots of the room's art with my camera phone and a friend of mine had a camera on hand to take a picture of me (I don't love the look on my face but when someone is doing a favor you can't have photoshoot style do'overs, a'well). Inspired by the room, this post is a collage of the art and photo of me...\nPhoto of me: Yoli Daniels\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/brrrr.html", "_id": {"$oid": "559be2d165f2886d5687ba07"}, "extracted_text": "October 16, 2010\nBrrrr!!!\nSo, today was the very first day I needed a winter accessory and though I probably love to accessorize more than any one normal person should, this made me a little sad. It was a beautiful fall day in NYC and though sunny, the wind was a bit out of control. Last time I was in Philly visiting the fam I snagged this gray and yellow knit hat complete with adorable ball and took it out for a test run today. Had brunch at Yatanga in Harlem (must try, very cool space!)My hat...really quite warm and cozy (Nordstrom).\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/granny-goes-to-war-invermont.html", "_id": {"$oid": "559be2d165f2886d5687ba08"}, "extracted_text": "October 19, 2010\nGranny Goes to War in...Vermont?\nBarefoot Tess might well be my absolute favorite online shoe store. Being a 5'10 big foot gal can make shoe shopping annoying at best and I really am not going to settle for shoes that make me sad so, BarefootTess.com to the rescue. This \"Loggin\" bootie from Jeffery Campbell (to me at least) are part, Granny boot, part Military, part Lumberjack and I love them! I'm leaning toward brown but am starting to identify a brown boot addiction which is the reason I never have black shoes to wear. I'll have to figure that one out. xx\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/gym-clothes-rat-s.html", "_id": {"$oid": "559be2d165f2886d5687ba09"}, "extracted_text": "October 13, 2010\nGym |clothes| Rat|s|\nI officially hate all of my gym clothes. Yesterday I threw on a pair of tights and a long fitted deep v neck tee and finally felt cute at the gym. I think I might seriously be allergic to crew neck teeshirts with that yucky seamed collar makes me soooo sad! The tights I wore however, I don't want to ruin, wear out or snag with my eliptical shenanigans and on the floor bendy \"core\" workout. I think I'm going to give these Nike Runner's Tech joints a try. They are a bit pricey for work out gear but are on sale so...I'm going to give them a whirl.\nBloomingdales.com sizes 1x-3x.\n"},
{"url": "http://www.andigetdressed.com/2010/10/holiday-hauteness.html", "_id": {"$oid": "559be2d165f2886d5687ba0a"}, "extracted_text": "October 11, 2010\nHoliday Hauteness\nOk...Monif C's new holiday looks are ridiculously fly. I'm sure everyone will be clamouring for the Nikita Leather Dress. The Nikita is a special order item which will take about 6 weeks for delivery and is totally non-refundable. Measure carefully...\nI'm also completely in love with the Eye Spy Coat which is currently available for Pre-Order.\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/i-love-these-hose.html", "_id": {"$oid": "559be2d265f2886d5687ba0b"}, "extracted_text": "October 23, 2010\ni LOVE these Hose!\nCool tights and panty hose can really transform an outfit. A classic dark colored opaque pair are fine, but hose with cool patterns, colors and lace add so much more interest. Here are a few from Avenue - 2 for $20!\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/i-wear-white-whenever-i-want.html", "_id": {"$oid": "559be2d265f2886d5687ba0c"}, "extracted_text": "October 12, 2010\nI Wear White Whenever I Want!\nYes, it's October in NYC and I'm wearing white jeans. I've decided I really love white jeans and plan on wearing them whenver I feel like it (smile). So here they are! I love this pair as they have tan stitching which really add interest. Do you guys have any self imposed rules for wearing white past the summer season? Curious minds want to know.\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/ootd-bad-kitty.html", "_id": {"$oid": "559be2d265f2886d5687ba0d"}, "extracted_text": "October 29, 2010\nOOTD: Bad Kitty!\nPre-Halloween party I attended was beyond fun. My costume was challenging because the party I went to is one where you dance, a lot...so being comfortable and having a non-cumbersome costume that won't fall apart when you twirl around 100 times in a row is key. Here's what I wore: Layered tank/sleeveless cardigan, tights that lace up the sides, and my Tess by Barefoot Tess \"Japanese\" boots. Added to that are kitty ears, a bell around my neck which I pulled off a studded collar and put onto a leather choker, fingerless faux leather studded gloves and of course no Bad Kitty is completed without a pink and black whip. I of course did a terrible job at remember to take pics before the party and sweaty post dancing makeup madness. But here's a little something. I'll do better next time, PROMISE!\nCurrently Coveting\n"},
{"url": "http://www.andigetdressed.com/2010/10/ootd-tough-stuff.html", "_id": {"$oid": "559be2d265f2886d5687ba0e"}, "extracted_text": "October 17, 2010\nOOTD - Tough Stuff\nI've mentioned on the Facebook Fatshion Insider page that I've more recently been gravitating toward black. Although I'm a fairly smiley person black makes me feel so TOUGH, haha! This jacket you're likely to see a lot. This asymetrical blazer styled jacket (leather front and jersey/sweatshirt material in the back) is sooooo easy to wear. I can throw it over anything and will. My harem styled jeans and hankercheif hem tank complete the outfit.\nHonestly I cannot remember where I got the tank but the Jacket came from a random boutique in NYC and the jeans in LA - I know, sorry. Shades, Dolce Gabana, sandals Steve Madden.\nCurrently Coveting\n"}]
